docs/Samples/registerLiteContract_minimal.xml

<?xml version="1.0"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <reg:registerLiteContract xmlns:reg="http://fxgate.web.cft.ru/registration">
      <reg:login>esb_user029</reg:login>
      <reg:person first-name="Юзер029" last-name="Банка">
        <reg:identity-card number="566029" issue-date="2012-09-19T06:18:33"
        issuer="УВД такое УВД №9" />
      </reg:person>
      <reg:contract payment-activation="false" otp-phone="0000000029">
        <reg:bank bic="044525348" name="АКБ &quot;ЛАНТА-БАНК&quot; (ЗАО)" />
      </reg:contract>
      <reg:account number="40817810567234465029" first-signs-count="1">
        <reg:bank bic="044525348" name="АКБ &quot;ЛАНТА-БАНК&quot; (ЗАО)" />
      </reg:account>
      <reg:account-rights account-number="40817810567234465029" statement-request="false"
      payment-create="true" payment-sign-level="1" exchange-debit-create="true"
      exchange-debit-sign-level="1" exchange-credit-create="true" exchange-credit-sign-level="1" />
    </reg:registerLiteContract>
  </S:Body>
</S:Envelope>